AD0809		XDATA	8000H			

			ORG		0000H
			
			AJMP	MAIN
			
;*****************************************************************************
;		/*采用查寻方式AD转换程序*/
;*****************************************************************************

			ORG		0030H
			
MAIN:		MOV	    DPTR,#AD0809
			MOV	    A,#00H
			MOVX	@DPTR,A				;启动AD转换
			CALL	DELAY				;延时
			MOVX	A,@DPTR				;转换结束读取结果
			MOV	    R0,A
			CALL	DISP
			CALL	DELAY
			CALL	DELAY
			CALL	DELAY
			CALL	DELAY
			AJMP	MAIN
		
;*****************************************************************************
;		/*显示子程序*/
;*****************************************************************************

DISP:		MOV		A,R0				;低位
			ANL		A,#0FH
			ACALL	DSEND				;显示
			MOV		A,R0
			SWAP	A
			ANL		A,#0FH				;高位
			ACALL	DSEND				;显示
			RET

DSEND:		MOV		DPTR,#SGTB1
			MOVC	A,@A+DPTR			;取字符
			MOV		SBUF,A	    		;发送字符
			JNB		TI,$				;等待串口发送完
			CLR		TI
			RET
			
;*****************************************************************************
;		/*延时程序*/
;*****************************************************************************	
		
DELAY:		MOV		R4,#250				;延时
DELAY1:		MOV		R5,#250
			DJNZ	R5,$
			DJNZ	R4,DELAY1
			RET
		
;*****************************************************************************
;		/*字符编码*/
;*****************************************************************************
				
SGTB1:		DB	     03H        		;0
		   	DB	     9FH         		;1
		   	DB	     25H         		;2
		   	DB	     0DH         		;3
		   	DB	     99H          		;4
		   	DB	     49H          		;5
		   	DB	     41H          		;6
		   	DB	     1FH         		;7
		   	DB	     01H          		;8
		  	DB	     09H          		;9
		  	DB	     11H          		;A
		   	DB	     0C1H          		;B
		   	DB	     63H         		;C
		   	DB	     85H         		;D
		   	DB	     61H          		;E
		   	DB	     71H          		;F
		   	DB	     00H				
	   					
	 		END		
		